import { Link } from "react-router-dom";
import './Poem.css';


const Poem=({poetId,title})=>{
    
    return(
        <div className="poem">
            <div className="container">
                <div className="poem--container">
                    <h1 className="poem--name">غزل شماره 439:</h1>
                    <div className="poem--text">دیدم به خواب دوش که ماهی برآمدی
                        کز عکس روی او شب هجران سر آمدی
                        تعبیر رفت یار سفرکرده می‌رسد
                        ای کاج هر چه زودتر از در درآمدی
                        ذکرش به خیر ساقی فرخنده فال من
                        کز در مدام با قدح و ساغر آمدی
                        خوش بودی ار به خواب بدیدی دیار خویش
                        تا یاد صحبتش سوی ما رهبر آمدی
                        فیض ازل به زور و زر ار آمدی به دست
                        آب خضر نصیبه اسکندر آمدی
                        آن عهد یاد باد که از بام و در مرا
                        هر دم پیام یار و خط دلبر آمدی
                        کی یافتی رقیب تو چندین مجال ظلم
                        مظلومی ار شبی به در داور آمدی
                        خامان ره نرفته چه دانند ذوق عشق
                        دریادلی بجوی دلیری سرآمدی
                        آن کو تو را به سنگ دلی کرد رهنمون
                        ای کاشکی که پاش به سنگی برآمدی
                        گر دیگری به شیوه حافظ زدی رقم
                        مقبول طبع شاه هنرپرور آمدی
                    </div>
                    <audio controls>
                        <source src="#"></source>
                    </audio>
                </div>
                <div className="description--container">
                    <h2>:ای صاحب فال</h2>
                    <p>خود را مأیوس و افسرده می بینی و از 
                        بدخواهی دشمن شکوه و شکایت داری.
                         خود را نباز و دل به تقدیر بسپار.
                         هر چه خیر است پیش می آید. 
                         به خدا توکل کن و با دوستان
                         دانا مشورت کن
                          تا راه چاره ای پیدا شود.</p>
                </div>
                <a className="back-btn"><Link to="/">باز گشت به صفحه اصلی</Link></a>
            </div>
        </div>
    )
}
export default Poem;